{
  "posts": [
    {
      "id": 1,
      "folder": "my-workspace",
      "title": "My Workspace",
      "date": "2026-01-15",
      "description": "Wow, so this is my workspace - the place I spend every day with... a few thousand lines of code and a ton of coffee. Happy coding!",
      "featuredImage": "/images/life/daily/my-workspace/featured.webp",
      "images": []
    },
    {
      "title": "Dự án ThinhPay và con đường học Java Spring Boot",
      "date": "2026-01-18",
      "description": "Ùm thì đây là 1 project được sinh ra để phục vụ công việc học Java Spring của tui... Java thì ye.. nó dính liền với các hệ thống banking nên tui đã nghĩ ra làm cái dự án này :)))\n\nDù sao thì nó đang tiến triển khá tốt, tui tận dụng Agent để code phần lớn, nhưng bản thân tôi cũng phải tự code chay một vài module quan trọng.. Ùm thì thời đại AI mà, cái gì nó cũng có AI support, mình k dùng thì mình sẽ bị thụt lùi về sau mất. \n\nDo có nền tảng từ ASP.NET, tui đúng như kiểu chỉ cần mapping kiến thức :)). Ví dụ nhá, Entity Framework(EF) là ORM bên ASP, v thì Java spring có gì? Tui đặt các câu hỏi tương tự như v với các kiến thức mà tôi đã biết. Và tất nhiên là nhờ vậy mà tui học rất nhanh, gần như chỉ mất vài ngày là tui đã lên kế hoạch triển khai Project.\n\nĐây là 1 dự án kết hợp giữa Hexagonal architechture, Domain Driven Design, CQRS(Command Query Responsibility Segregation). Tui ôm nhiều công nghệ khó v vì tui muốn 1 project chuẩn chỉ, để học bao quát các kiến thức.\n\nTất nhiên là để nhắm tới làm việc trong 1 công ty chuyên làm về các dự án Fintech r",
      "folder": "thinhpay_1",
      "featuredImage": "/images/life/daily/thinhpay_1/featured.webp",
      "images": [],
      "id": 2
    },
    {
      "title": "Vibe code 1 chút với project.. và việc mất ngủ?",
      "date": "2026-01-19",
      "description": "Chắc ta sẽ bắt đầu bằng việc.. mất ngủ\n\nBữa h tui khá là lạ đời về việc sức khỏe, tầm cỡ 9h30 or 10h là tui bắt đầu đi ngủ r, nhma k hiểu sao chỉ ngủ mơ màng dc 1 tiếng r sau đó tui lại dậy. Thay vì phí thời gian nằm lăn qua lăn lại, tui ngồi code..\n\nĐêm nay tui vibe code 1 ít module Payment Hub, chủ yếu là ngồi xàm với AI để tạo database r dùng JPA buddy scaffold các entity xuống.\n\nCứ đà này thì chắc tầm nửa tháng nữa sẽ xong nhỉ.. mong là rush trong 1 tuần để còn refactor lại 1 project :))\n\nHôm nay tui hết request của cả 2 acc github copilot student(đừng hỏi tại sao tui lại có 2 acc :)), 1 tài khoản student tui mượn của bạn để xài). Nên tui qua Antigravity, cơ mà anh em dòng họ của VS Code support Java chán quá, tui phải ngồi fix 1 hồi nó mới nhận dc các dependencies. Nhưng ít ra nó work r, dùng Antigravity code và xài AI. Còn debug hay test thì dùng IntelliJ là hợp lý",
      "folder": "thinhpay_2",
      "featuredImage": "/images/life/daily/thinhpay_2/featured.webp",
      "images": [],
      "id": 3
    }
  ]
}
